// pages/jou/jou.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    infor: [{
        gong: '投递人: 王乐微 17********@qq.com2019-11-04 21:42 寄往 2020-11-03 21:35写给一年后的自己哈喽！ 我是一年前的你在你小的时候开始到现在就有许多想实现但是还没有实现的梦 从小学到现在高中跌跌撞撞 来到了职高音乐班 这不正是你喜欢的专业吗  如果喜欢为什么不把它做好呢  你想在未来的两年后考上一所关于音乐的大专，让这个开始发芽的梦变成一颗可以让我依靠的参天大树，希望你以后的生活至少不愁吃穿 有着固定的收入 和喜欢的人一起。如果你没有考上大专 你或许会颓废 遗憾可惜 我希望当你收到这封信时能开心一些  没有什么成功是一蹶而就的 条条大路通罗马  没有失败哪里来的成功祝你两年后前程似锦 一帆风顺！'
      },
      {
        gong: '投递人: zhang_wen_jian 26********@qq.com2019-11-02 20:04 寄往 2020-10-17 10:16你收到这封信的时候离我们分开已经一年多了吧，不知道现在的你还好吗，祝你生日快乐？给你写信的这天收到你寄来的东西了，凌晨给你发完消息，早上才发现你昨天下午就把东西给我寄过来了，完美错过。我也不知道该怎么处理对你的感情，我会慢慢长大，成熟，如果你还在就好了，唉今天翻到QQ会话框里QQ精选在3月25日推送的一条消息：最亲密的关系，是彼此独立。我记得我从来不看这些的，那天也正好是我们在一起的第一天，可能你从第一天开始就想告诉我这些吧，可惜现在才看到，也才懂得这句话，好了，不烦你了，祝好！'
      },
    ]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})